# 데이터프레임 연습문제

### 1. 패키지 임포트

In [1]:
# 필요 패키지 import
import numpy as np
import pandas as pd

### 2. 데이터프레임 생성

#### 1) 다음의 조건을 만족하는 데이터프레임을 생성하시오.

- 데이터(values) : numpy 패키지의 randn 함수를 이용해서 난수 n 개 생성
- 행방향 인덱스(index) : date_range()를 이용한 날짜 데이터
- 열방향 인덱스(column) : ['A','B','C','D']
- 데이터프레임 이름 : df1

In [18]:
#방법1
columns=['A','B','C','D']
index=list(pd.date_range(start='2019-01-06', periods=6, freq='w'))

df1 = pd.DataFrame(np.random.randn(6, 4), columns=columns, index=index)
#df1

In [15]:
#방법2
df1 = pd.DataFrame(np.random.randn(6, 4), columns='A B C D'.split(), index=list(pd.date_range(start='2019-01-06', periods=6, freq='w')))
#df1

In [5]:
#결과값 참고

                   A         B         C         D
2019-01-06 -0.312313 -0.444084  0.535576  0.641823
2019-01-13  0.122783  0.888629 -1.821207 -1.373925
2019-01-20  0.138339  0.335618  1.317537  0.436483
2019-01-27 -0.275745  0.581841 -0.395643  0.385251
2019-02-03 -1.789857  0.018260 -0.972359 -0.338776
2019-02-10 -0.884262 -0.623506 -1.473571 -1.646648

#### 2) 다음 결과와 같은 데이터프레임을 생성하시오.

In [17]:
index = ['홍길동', '이몽룡', '성춘향', '변학도', '김연아']
data = {'나이': [22, 45, 22, 33, 27], 
        '몸무게': [60.1, 51.3, 68.3, 88.3, 48.3], 
        '키': [170.5, 157.3, 180.1, 190.2, 160.1], 
        '성별':['남', '여', '남', '남', '여'], 
        '주소':['서울', '부산', '대구', '제주', '강릉']}

df2 = pd.DataFrame(data, index=index)
#df2

In [6]:
#결과값 참고

     나이   몸무게      키 성별  주소
홍길동  22  60.1  170.5  남  서울
이몽룡  45  51.3  157.3  여  부산
성춘향  22  68.3  180.1  남  대구
변학도  33  88.3  190.2  남  제주
김연아  27  48.3  160.1  여  강릉

### 3. 데이터프레임 전치

- 문제2의 2) 데이터프레임 df2를 전치 후 df3로 저장하고 원본과 비교 출력하시오.

In [19]:
df3 = df2.T
df2
df3

       홍길동    이몽룡    성춘향    변학도    김연아
나이      22     45     22     33     27
몸무게   60.1   51.3   68.3   88.3   48.3
키    170.5  157.3  180.1  190.2  160.1
성별       남      여      남      남      여
주소      서울     부산     대구     제주     강릉

In [8]:
#결과값 참고

       홍길동    이몽룡    성춘향    변학도    김연아
나이      22     45     22     33     27
몸무게   60.1   51.3   68.3   88.3   48.3
키    170.5  157.3  180.1  190.2  160.1
성별       남      여      남      남      여
주소      서울     부산     대구     제주     강릉

### 4. 인덱싱 문제

#### 1) 다음 데이터프레임을 생성하시오.

- 데이터는 딕셔너리를 이용하여 df4로 생성하시오.

In [26]:
data = {'국어':[80, 90, 70, 30], '영어':[90, 70, 60, 40], '수학':[90, 60, 80, 70]}
df4 = pd.DataFrame(data, index=['춘향', '몽룡','향단', '방자'])
#df4

In [10]:
#결과값 참고

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

#### 1) 모든 학생의 수학 점수를 시리즈로 나타낸다.

In [27]:
# 모든 학생의 수학 점수를 시리즈로 나타낸다.
df4['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [10]:
# 결과값 참고: 모든 학생의 수학 점수를 시리즈로 나타낸다.

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

#### 2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.

In [28]:
# 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df4[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [11]:
# 결과값 참고: 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

#### 3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

In [45]:
# 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df4['평균점수']= list(np.mean([df4['국어'], df4['영어'], df4['수학']], dtype='float', axis=0))
df4

    국어  영어  수학       평균점수
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [12]:
# 결과값 참고: 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

    국어  영어  수학       평균점수
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

#### 4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

In [55]:
# 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

df4.loc['방자':'방자', '영어'] = 80
df4['평균점수']= list(np.mean([df4['국어'], df4['영어'], df4['수학']], dtype='float', axis=0))
#df4

In [18]:
#결과값 참고

    국어  영어  수학       평균점수
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  60.000000

#### 5) 몽룡의 점수를 데이터프레임으로 나타낸다.

In [56]:
# 몽룡의 점수를 데이터 프레임으로 나타내는 경우

df4['몽룡':'몽룡']

    국어  영어  수학       평균점수
몽룡  90  70  60  73.333333

#### 6) 향단의 점수를 시리즈로 나타낸다.

In [64]:
# 향단의 점수 시리즈로 시리즈는 열방향 데이터일 경우에 추출 가능

df5= df4.T
df5['향단']

국어      70.0
영어      60.0
수학      80.0
평균점수    70.0
Name: 향단, dtype: float64

In [21]:
# 결과 참고

국어      70.0
영어      60.0
수학      80.0
평균점수    70.0
Name: 향단, dtype: float64

pandas.core.series.Series